benchmarksuite/acceleration/sloshingSinWave/sinWave/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interCapturingFoam;

//startFrom       startTime;
startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          1e-7;

writeControl    adjustableRunTime;

writeInterval   0.02;

//writeControl    timeStep;

//writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression yes;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.1;
maxAlphaCo      0.1;
maxCapillaryNum 5.0; //0.5;

maxDeltaT       1e-3;

libs
(
    "libtwoPhaseProperties.so"
);

functions
{

    surfaces
    {
        type            surfaces;
        functionObjectLibs
        (
            "libsampling.so"
        );

        // Write at same frequency as fields
        writeControl    outputTime;
        writeInterval   1;
        surfaceFormat   raw;
        fields
        (
            alpha.water
        );
        interpolationScheme cellPoint;
        surfaces
        (
            constantIso
            {
                type        isoSurfaceCell;
                isoField    alpha.water;
                isoValue    0.5;
                interpolate true;
            }
        );
    }

    maxU
    {
        type            fieldMinMax;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   1;
            // Report the location of the field extrema
        location   no;

        fields          (U);
    }
}

// ************************************************************************* //
