benchmarksuite/acceleration/sloshingSinWave/sinWave/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "simulationParameters"

solvers
{
    alpha.water
    {
        interfaceType            $MethodType;
        interfaceCapturingScheme $advectStrat;
        interfaceRepresentation  $reconStrat;
        nAlphaCorr      2;
        nAlphaSubCycles 1;
        cAlpha          1;

        isoFaceTol      1e-6;
        surfCellTol     1e-6;
        nAlphaBounds    3;
        snapTol         1e-12;
        clip            true;

        MULESCorr       yes;
        nLimiterIter    5;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;

    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }

    "p.*"
    {
        solver          GAMG;
        tolerance       1e-09;
        relTol          0.001;
        smoother        DIC;
    }

    "p.*Final"
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-07;
            relTol          0;
            nVcycles        2;
            smoother        DICGaussSeidel;
            nPreSweeps      2;
        }
        tolerance       1e-10;
        relTol          0;
        maxIter         100;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-20;
        relTol          0;
        minIter 5;
    }

    UFinal
    {
        solver          smoothSolver;
        smoother        DILUGaussSeidel;
        //solver          PBiCGStab;
        //preconditioner  DILU;
        tolerance       1e-10;
        relTol          0;
        minIter 5;
    }
}

PIMPLE
{
    momentumPredictor yes;
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
    correctPhi      no;

    pRefPoint       (0.00001 -0.003 0);
    pRefValue       0;
}


// ************************************************************************* //
